var verify = {
    score: function (value, item) {
        if (value < 60) {
            return '分数必须大于60';
        };
    },
    length: [/^[\S]{6,12}$/, '长度必须是6到12位'],
    email: [/^[a-z0-9._%-]+@([a-z0-9-]+\.)+[a-z]{2,4}$|^1[3|4|5|7|8]\d{9}$/, '邮箱格式不对'],
    name: [/^[a-zA-Z0-9_\u4E00-\u9FFF]+$/, '必须是字母,数字,汉字,下划线'],
    phone: [/^1[3456789]\d{9}$/, '手机号码不正确'],  
    requiredType: [/^[1-9]\d*$/, '必须选择一个类型'],//枚举转换的下拉列表选择 大于0
    decimalNumber: [/^[0-1]{1}([.]([0-9]){1,2})?$/, '必须时0.00至1之间的数字'],
    money: [/(^[1-9]([0-9]+)?(\.[0-9]{1,2})?$)|(^(0){1}$)|(^[0-9]\.[0-9]([0-9])?$)/, '请输入正确的金额格式'], //2位小数
    //money: [/((^[1-9]\d*)|^0)(\.\d{0,2}){0,1}$/, '请输入正确的金额格式'],             
    number: [/^[0-9]\d*$/, '必须选择一个类型'],//枚举转换的下拉列表选择 
    int: [/^[0-9]\d*$/, '请输入不包含小数的数字'],//整数 
    decimalNumber4: [/^(([1-9][0-9]*)|(([0]\.\d{1,4}|[1-9][0-9]*\.\d{1,4})))$/, '请输入正确的格式'],//0-4位小数
    fulltimer: [/ ^(\\d{4})(\\-)(\\d{2})(\\-)(\\d{2})(\\s+)(\\d{2})(\\:)(\\d{2})(\\:)(\\d{2})$/, '日期格式不正确'],//2019-06-22 10:10:10  完整日期格式
    timer: [/^(\d{4})(-)(\d{2})(-)(\d{2})$/, '日期格式不正确'],//2019-06-22 年月日格式
    pwd: [/^[^\u4e00-\u9fa5]{6,20}$/, '输入密码长度6-20位字符，不包含中文'],
    code: [/^[^\u4e00-\u9fa5]{2,32}$/, '输入长度2-32位字符，不包含中文'],
    uploadimg:[/\.(gif|jpg|jpeg|png|GIF|JPG|PNG)$/,'上传的文件不符合格式'], //图片格式
    empty:[/^\s*$/,'输入的内容不能为空'],//非空验证
    identity:[/^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/,'身份证输入错误'],//身份证 
    num:[/^(\-|\+)?\d+(\.\d+)?$/,'请输出正确的数字'],//正数，负数,者小数
    cardID:[/^([a-z0-9]){1,20}$/,'请输入1-20位字母+数字'],//卡面号
    coupon:[/^[0-9A-F]{8}.*$/,'请输入8位字符'],
    vehicleNumber: [/^\s{0}$|^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/, '您输入的车牌号码不正确'],//车牌号
    special: function (value) {
        if (value && new RegExp(/[@#\$%\^&\*<>]+/g).test(value)) {
            return "不能输入特殊字符";
        }
    },
    //固定页面(自定义字段) 当前字段验证要通过另外一个字段值去确定验证类型。
    fieldValues: function (value) {
        var FieldType = $('#CustomField_FieldType').val();
        if (FieldType == 4 && !value) {
            return I18n.T("请输入属性值");
        }
    },
};